Refactor docs (#88)
* refactor docs

* refactor docs
